<template>
  <div class="about">
    <div class="container">
      <div class="row">
        <div class="col col-8 col-lg-12 wysiwyg">
          <h2 class="h2-title">О ресторане</h2>
          <p class="text-m text-md-s">
            Обычно люди приходят в Додо Пиццу, чтобы просто поесть. Наши промоутеры раздают листовки
            про кусочек пиццы за двадцать рублей или ещё что-то выгодное. Мы делаем это как первый
            шаг, чтобы познакомиться.
          </p>
          <p class="text-m text-md-s">
            Но для нас Додо — не только пицца. Это и пицца тоже, но в первую очередь это большое
            дело, которое вдохновляет нас, заставляет каждое утро просыпаться и с интересом
            продолжать работу.
          </p>
          <p class="text-m text-md-s">В чём же наш интерес? Сейчас расскажем.</p>

          <h4 class="h4-title">Идеальные ингредиенты</h4>
          <p class="text-m text-md-s">
            Почему мы так хотим познакомиться? Потому что дальше пицца делает всё сама. Люди видят,
            что она вкусная, и возвращаются снова. Нам главное первый раз это показать.
          </p>
          <p class="text-m text-md-s">
            Вообще пицца — очень простая штука, её сложно испортить. Достаточно хороших ингредиентов
            и правильного теста. Это конструктор, если детали качественные, то и результат будет в
            порядке. Вот они, наши детали.
          </p>
          <p class="text-m text-md-s">
            Кто угодно может сделать вкусную пиццу. А шеф-повар итальянского ресторана сделает и
            вовсе шедевр. Он молодец. Но представьте, что вам нужно сделать вкусную пиццу в сотнях
            пиццерий, за сотни километров друг от друга. Это наш случай, у нас их вон уже сколько.
          </p>
        </div>
        <div class="col col-4 col-lg-6">
          <div class="img-bottom">
            <img src="~/assets/img/developer.svg" alt="" />
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<style>
.about {
  margin: 90px 0 120px;
}
.img-bottom {
  margin-top: auto;
}
</style>
