<template>
  <div class="widget">
    <div class="widget__sidebar">
      <div class="widget__title text-xl">Проверьте, входит ли ваш адрес в зону доставки</div>
      <div class="widget__search">
        <UiInput
          ref="searchRef"
          placeholder="Адрес"
          icon="search"
          :value="search"
          :error="errors.search"
          @on-change="handleSearchChange"
        />
        <div v-if="geoData.found === true" class="widget__zone-found text-l fw-500">
          Поздравляем! Ваш адрес входит в зону доставки!
        </div>

        <div v-if="geoData.found === false" class="widget__zone-error text-s">
          Ваш адрес пока что не входит в зону доставки, но мы работаем над этим.
          <br /><br />
          Пожалуйста введите другой адрес или выберите пункт самовывоза.
        </div>
      </div>
    </div>
    <div class="widget__map">
      <ClientOnly>
        <YandexMap
          :coordinates="[59.939099, 30.315877]"
          :zoom="9"
          :controls="['geolocationControl']"
          :scroll-zoom="false"
          @created="(v) => (mapInstance = v)"
        >
        </YandexMap>
      </ClientOnly>
    </div>
  </div>
</template>

<script setup lang="ts">
import { useField, useForm } from 'vee-validate'
import { useDeliveryStore } from '~/store'

const deliveryStore = useDeliveryStore()

const searchRef = ref(null)

const { errors, setErrors, setFieldValue } = useForm({
  initialValues: { search: '' },
})

const { value: search } = useField<string>('search')

const handleSearchChange = (v) => {
  setFieldValue('search', v)
}

const { ymapsInstance, geocoderSuggestionObj } = useGeocoder({
  searchRef,
  setFieldValue,
  setErrors,
  onMounted: (ymaps) => mapPolygonCollection(),
})

const geoData = ref({
  requested: false,
  latitude: null,
  longitude: null,
  found: null,
  text: '',
})

watch(
  () => geocoderSuggestionObj.value,
  async (newVal) => {
    const coords = newVal?.geometry._coordinates
    const data = newVal?.properties._data

    const zone = await deliveryStore.checkZone({
      latitude: coords[0],
      longitude: coords[1],
      passive: true,
    })

    geoData.value = {
      requested: true,
      found: zone.found,
      latitude: coords[0] || null,
      longitude: coords[1] || null,
      text: zone.found ? data.text : '',
    }
  }
)

// Карта
const mapInstance = ref(null)
const mapPolygonCollection = () => {
  if (!window.ymaps || !mapInstance.value) return

  const myPolygon = new window.ymaps.Polygon(
    [
      [
        [59.982949914972124, 30.25641509219339],
        [59.98292841003376, 30.26559897586043],
        [59.9819391673011, 30.27066298648053],
        [59.98181013345349, 30.275383674346738],
        [59.98361656139717, 30.28662749453719],
        [59.983917623105, 30.29340811892683],
        [59.983659570380794, 30.30104705020123],
        [59.982713359789, 30.305767738067463],
        [59.981423028882894, 30.313578330718833],
        [59.98073483176507, 30.318899833404377],
        [59.98004662029248, 30.322161399566486],
        [59.97679549088547, 30.328624394269497],
        [59.97219225414692, 30.334890034528275],
        [59.97004098881954, 30.335576680036084],
        [59.968061700881535, 30.336864140363236],
        [59.96896530357599, 30.342872288556592],
        [59.96961071892858, 30.347077992291958],
        [59.96994417857403, 30.34913792881539],
        [59.96731650202366, 30.350173618639506],
        [59.9642988671115, 30.35131087526174],
        [59.96392231577245, 30.353048946703385],
        [59.963879281060244, 30.355130340898924],
        [59.96330906582807, 30.359121467913084],
        [59.962685045420756, 30.366245415056643],
        [59.962457484370205, 30.379361072159877],
        [59.96125283595024, 30.391356388358435],
        [59.96039698168194, 30.396143206125295],
        [59.95747018100545, 30.403739222055457],
        [59.95894967484596, 30.407079655763983],
        [59.96022794274187, 30.438272900186135],
        [59.9606190207882, 30.452394885849706],
        [59.96213611032358, 30.460548801254998],
        [59.97079950910653, 30.49191427970309],
        [59.981841958667864, 30.508525089033984],
        [59.98838887225418, 30.486090205691124],
        [59.990924991149406, 30.482502120026126],
        [59.99432177540709, 30.47889723111012],
        [59.996901377790564, 30.477266448029056],
        [60.00021157185727, 30.476322310455824],
        [60.003693365388436, 30.476322310455824],
        [60.00670202655262, 30.476322310455824],
        [60.00929440558197, 30.475145306133886],
        [60.01140013936372, 30.473342861675896],
        [60.01333385798985, 30.470853771710072],
        [60.01509559172482, 30.467506374859486],
        [60.016642402219574, 30.46372982456651],
        [60.01775949797061, 30.46021076633898],
        [60.0191772957243, 30.45720669224229],
        [60.02085330021342, 30.454956990405943],
        [60.03326653307458, 30.442425709888365],
        [60.03515602666086, 30.44096658818427],
        [60.03764655707342, 30.43993661992254],
        [60.03954371554587, 30.4392331412659],
        [60.041475782470904, 30.437731104217566],
        [60.04312868304398, 30.43567116769413],
        [60.04473857133273, 30.432495432220495],
        [60.04589764213892, 30.429663019500776],
        [60.04690642979792, 30.426787691436793],
        [60.04785079872877, 30.423397379241976],
        [60.04926730130895, 30.417689638458274],
        [60.05036182971978, 30.413097696624778],
        [60.051273867167865, 30.40916942794418],
        [60.052282490015536, 30.40517830093002],
        [60.05311940890433, 30.401959650112147],
        [60.05429964294882, 30.398740999294272],
        [60.055103301016096, 30.396738456148988],
        [60.05630492100248, 30.3943781122159],
        [60.057656691021215, 30.392017768282784],
        [60.05928732378308, 30.390086577792058],
        [60.06044588214684, 30.388884948153382],
        [60.05375142606412, 30.382748053927315],
        [60.05811028035872, 30.36171109186141],
        [60.056758528980794, 30.36059529291123],
        [60.061787086253105, 30.33673093810406],
        [60.06785653129255, 30.30748289627628],
        [60.067384637315925, 30.302075562902235],
        [60.06173942273449, 30.28279464595333],
        [60.057577168183165, 30.288416556048507],
        [60.05345730483124, 30.293780974078338],
        [60.0467614263466, 30.299188307452358],
        [60.03580362193494, 30.307565648167998],
        [60.0353462599146, 30.308829541035248],
        [60.03458940629623, 30.308411116428935],
        [60.03402578059671, 30.310235018559055],
        [60.0330160979427, 30.310694520174064],
        [60.03206373439509, 30.30722072883792],
        [60.03038324408327, 30.308992740226426],
        [60.02712793025256, 30.312604029391572],
        [60.02699412887561, 30.312739068178843],
        [60.026355204995575, 30.311322861818983],
        [60.0262209757141, 30.31096881022901],
        [60.02590024417082, 30.309656044143132],
        [60.02533110039743, 30.305407425063528],
        [60.02502362657322, 30.30303236838864],
        [60.02494308581375, 30.301830738749988],
        [60.024669245758325, 30.299824446406845],
        [60.02441688133835, 30.298322409358484],
        [60.02416988450172, 30.29638049003171],
        [60.023804755350326, 30.29348370429562],
        [60.02354164507023, 30.291670531001554],
        [60.02333736404407, 30.29011399286158],
        [60.02310109849541, 30.288397379092064],
        [60.02294000737693, 30.287174291781255],
        [60.022886310162356, 30.286423273257103],
        [60.0228702009809, 30.28576881425745],
        [60.022897049612276, 30.2850392534054],
        [60.02297759537505, 30.284320421389406],
        [60.02314405599397, 30.2829149438656],
        [60.02325681916105, 30.282131738833264],
        [60.01723825836877, 30.279028280910456],
        [60.017653232722665, 30.275173084058775],
        [60.01814732227842, 30.271203414716748],
        [60.01544047990213, 30.269894496717466],
        [60.01289907773018, 30.26861349057556],
        [60.013436208742164, 30.26440778684019],
        [60.0107034948743, 30.262936389114383],
        [60.00856548423185, 30.261713301803578],
        [60.00808199525967, 30.259095465805043],
        [60.00111836718096, 30.2556849204894],
        [59.99980726222528, 30.254955359637353],
        [59.996560760508046, 30.25520567604547],
        [59.99060995912143, 30.255849849222525],
        [59.98643870563398, 30.256236087320655],
        [59.982949914972124, 30.25641509219339],
      ],
    ],
    {
      hintContent: 'Зона доставки. Товар доставляется в рабочие дни с 12:00 до 21:30.',
    },
    {
      fillColor: '#56db40',
      fillOpacity: 0.6,
      strokeColor: '#1bad03',
      strokeWidth: 5,
      strokeOpacity: 0.9,
    }
  )

  mapInstance.value.geoObjects.add(myPolygon)
}

watch(
  () => mapInstance.value,
  (inst) => {
    if (inst) mapPolygonCollection()
  }
)
</script>

<style lang="scss" scoped>
.widget {
  margin-top: 32px;
  display: flex;
  &__sidebar {
    flex: 0 0 50%;
    padding-right: 45px;
  }
  &__search {
    margin-top: 24px;
    :deep(.ymaps-2-1-79-search__suggest) {
      top: 22px;
      border: 0;
      border-radius: var(--input-border-radius);
      overflow: hidden;
    }
    :deep(.ymaps-2-1-79-suggest-item) {
      margin: 0;
      font-family: var(--font-base);
      font-size: 16px;
      line-height: 26px;
      color: var(--color-font-invert);
      border-bottom: 1px solid var(--color-border);
    }
    :deep(.ymaps-2-1-79-search__suggest-item) {
      padding: 19px 24px;
      transition: background 0.25s $ease;
    }
    :deep(.ymaps-2-1-79-search__suggest-item_selected_yes) {
      background: var(--color-primary);
      color: var(--color-font);
    }
    :deep(.ymaps-2-1-79-search__suggest-highlight) {
      font-weight: 500;
    }
  }

  &__map {
    flex: 0 0 50%;
    position: relative;
    display: flex;
    flex-direction: column;
    border-radius: var(--map-border-radius);
    overflow: hidden;
    height: 460px;
    background: var(--color-bg);
    > section {
      flex: 1 1 auto;
      height: 100%;
    }
  }

  &__zone-found {
    color: var(--color-green);
    margin: 24px 0;
  }
  &__zone-error {
    margin: 16px 0;
    max-width: 360px;
    background: var(--color-red);
    color: var(--color-font);
    padding: 30px 24px;
    border-radius: var(--card-border-radius);
  }
}

@include r($md) {
  .widget {
    flex-wrap: wrap;
    &__sidebar,
    &__map {
      flex: 0 0 100%;
    }
    &__map {
      margin-top: 24px;
    }
    &__zone-error {
      padding: 16px 16px;
    }
  }
}

@include r($sm) {
  .widget {
    &__map {
      height: 320px;
    }
  }
}
</style>
